# Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3], 
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame(
{
    'author_id':[1, 2, 3],
    'author_name':['Turgenev', 'Chekhov', 'Ostrovskiy'],    
}
)

authors

   author_id author_name
0          1    Turgenev
1          2     Chekhov
2          3  Ostrovskiy

In [3]:
books = pd.DataFrame({
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Fathers and Sons', 'Rudin', 'Home of the Gentry', 'Fat and Thin', 'The Lady with the Dog',
                  'The Storm ', 'Talents and Admirers'],
    'price': [450, 300, 350, 500, 450, 370, 290],
})
books

   author_id             book_title  price
0          1       Fathers and Sons    450
1          1                  Rudin    300
2          1     Home of the Gentry    350
3          2           Fat and Thin    500
4          2  The Lady with the Dog    450
5          3             The Storm     370
6          3   Talents and Admirers    290

Q: а как выводить сразу несколько фреймов в одной линии, или так нельзя? Сначала создал два ДФ в одной строке, но когда попылася вывести оба сразу - получил ошибку.

# Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [4]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')
authors_price

   author_id author_name             book_title  price
0          1    Turgenev       Fathers and Sons    450
1          1    Turgenev                  Rudin    300
2          1    Turgenev     Home of the Gentry    350
3          2     Chekhov           Fat and Thin    500
4          2     Chekhov  The Lady with the Dog    450
5          3  Ostrovskiy             The Storm     370
6          3  Ostrovskiy   Talents and Admirers    290

# Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [5]:
authors_price.nlargest(5,'price')

   author_id author_name             book_title  price
3          2     Chekhov           Fat and Thin    500
0          1    Turgenev       Fathers and Sons    450
4          2     Chekhov  The Lady with the Dog    450
5          3  Ostrovskiy             The Storm     370
2          1    Turgenev     Home of the Gentry    350

# Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора.

In [28]:
#import numpy as np
authors_stat = authors_price.groupby('author_name')
#authors_stat['price'].agg({'min_price':'min', 'max_price':'max', 'mean_price':'mean'})
#authors_stat['price'].agg([np.min, np.max, np.mean]).rename(columns={'amin': 'min_price', 
#                                                                     'amax': 'max_price', 'mean': 'mean_price'})
authors_stat['price'].agg({'mean','max', 'min'})

             max        mean  min
author_name
Chekhov      500  475.000000  450
Ostrovskiy   370  330.000000  290
Turgenev     450  366.666667  300

# Задание 5

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.

Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [42]:
import numpy as np

authors_price.loc[authors_price['book_title'].notnull(), 'cover'] = ['hard', 'soft', 'soft', 'soft', 'hard', 'soft', 'soft']

             author_id author_name             book_title  price cover
0                  1.0    Turgenev       Fathers and Sons  450.0  hard
1                  1.0    Turgenev                  Rudin  300.0  soft
2                  1.0    Turgenev     Home of the Gentry  350.0  soft
3                  2.0     Chekhov           Fat and Thin  500.0  soft
4                  2.0     Chekhov  The Lady with the Dog  450.0  hard
5                  3.0  Ostrovskiy             The Storm   370.0  soft
6                  3.0  Ostrovskiy   Talents and Admirers  290.0  soft
author_name        NaN         NaN                    NaN    NaN   NaN

Q1: не разобрался с синтаксисом loc, что такое первый аргумент?
Q2: а как-то можно добавлять столбец не в конец, а между?

In [50]:
#?pd.pivot_table
book_info = pd.pivot_table(authors_price, values='price', index='author_name', columns='cover', aggfunc=np.sum, fill_value = 0 )
book_info.to_pickle('book_info.pkl')
read_info = pd.read_pickle('book_info.pkl')
print(read_info)

cover        hard  soft
author_name
Chekhov       450   500
Ostrovskiy      0   660
Turgenev      450   650